InformationRegisters/DMS_ПринятыеЧастиПакетовОбменаПоАвтоработам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_ПринятыеЧастиПакетовОбменаПоАвтоработам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧастьПакета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЧастейПакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаБезРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФайлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_ПринятыеЧастиПакетовОбменаПоАвтоработам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьПолученнуюЧастьПакета(СтруктураЧастиПакета) Экспорт 
	
	Период = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.DMS_ПринятыеЧастиПакетовОбменаПоАвтоработам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторФайлаОбмена.Установить(СтруктураЧастиПакета.ИдентификаторФайлаОбмена);
	НаборЗаписей.Отбор.НомерЧасти.Установить(СтруктураЧастиПакета.НомерЧасти);
	НаборЗаписей.Отбор.Период.Установить(Период);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	ЗаполнитьЗначенияСвойств(НоваяЗапись,СтруктураЧастиПакета);
	НоваяЗапись.ИмяФайлаБезРасширения = СтруктураЧастиПакета.ИмяБезРасширения;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьПакетДляЗагрузки(ИдентификаторФайлаОбмена) Экспорт
	
	КаталогОбъединенияФайлов = КаталогВременныхФайлов()+"MergeFiles";
	
	СоздатьКаталог(КаталогОбъединенияФайлов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторФайлаОбмена", ИдентификаторФайлаОбмена);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЧастиПакета.ИдентификаторФайлаОбмена КАК ИдентификаторФайлаОбмена,
		|	ЧастиПакета.НомерЧасти КАК НомерЧасти,
		|	ЧастиПакета.ЧастьПакета КАК ЧастьПакета,
		|	ЧастиПакета.Период КАК Период,
		|	ЧастиПакета.ВсегоЧастейПакета КАК ВсегоЧастейПакета,
		|	ЧастиПакета.ИдентификаторБазы КАК ИдентификаторБазы,
		|	ЧастиПакета.Расширение КАК Расширение,
		|	ЧастиПакета.ИмяФайлаБезРасширения КАК ИмяФайлаБезРасширения,
		|	ЧастиПакета.Размер КАК Размер,
		|	ЧастиПакета.ИмяФайлаБезРасширения + ЧастиПакета.Расширение КАК ИмяФайла
		|ИЗ
		|	РегистрСведений.DMS_ПринятыеЧастиПакетовОбменаПоАвтоработам КАК ЧастиПакета
		|ГДЕ
		|	ЧастиПакета.ИдентификаторФайлаОбмена = &ИдентификаторФайлаОбмена
		|ИТОГИ
		|	МАКСИМУМ(Расширение)
		|ПО
		|	ИдентификаторФайлаОбмена";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПакета = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаПакета.Следующий() Тогда
		
		МассивИменФайловДляОбъединения = Новый Массив;
				
		ИмяФайлаПакета = ПолучитьИмяВременногоФайла(".zip");
		
		ВыборкаФайлов = ВыборкаПакета.Выбрать();
		
		Пока ВыборкаФайлов.Следующий() Цикл
			
			ИмяФайла = КаталогОбъединенияФайлов + "\" + СокрЛП(ВыборкаФайлов.ИмяФайла);
			
			ВыборкаФайлов.ЧастьПакета.Получить().Записать(ИмяФайла);
			
			МассивИменФайловДляОбъединения.Добавить(ИмяФайла);
			
		КонецЦикла;
		
		ОбъединитьФайлы(МассивИменФайловДляОбъединения,ИмяФайлаПакета);
		
		УдалитьФайлы(КаталогОбъединенияФайлов);
		
		Файл = Новый Файл(ИмяФайлаПакета);
		
		Если Файл.Существует() Тогда
			
			ФайлЗагрузки = Новый ДвоичныеДанные(ИмяФайлаПакета);			
			УдалитьФайлы(ИмяФайлаПакета);
			
			Файл = Неопределено;
			
			Возврат ФайлЗагрузки;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьПакетДляЗагрузки()
 
#КонецЕсли
